In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

# Series

In [4]:
sample_pandas_data = pd.Series([0,10,20,30,40,50,60,70,80,90])
print(sample_pandas_data)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [6]:
#印出資料值
print('資料值:', sample_pandas_data.values)
#印出索引值
print('索引值:', sample_pandas_data.index)

資料值: [ 0 10 20 30 40 50 60 70 80 90]
索引值: RangeIndex(start=0, stop=10, step=1)

# Specify index in Series

In [8]:
sample_pandas_index_data = pd.Series(
    [0, 10,20,30,40,50,60,70,80,90],
    #輸入自訂的文字index
    index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
)
print(sample_pandas_index_data)

a     0
b    10
c    20
d    30
e    40
f    50
g    60
h    70
i    80
j    90
dtype: int64

In [9]:
print('資料值:', sample_pandas_index_data.values)
print('索引值:', sample_pandas_index_data.index)

資料值: [ 0 10 20 30 40 50 60 70 80 90]
索引值: Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

# DataFrame

In [10]:
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}

attri_data_frame1 = DataFrame(attri_data1)

print(attri_data_frame1)

    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve

# Specify Index in DataFrame

In [11]:
attri_data_frame_index1 = DataFrame(attri_data1,index=['a','b','c','d','e'])
print(attri_data_frame_index1)

    ID       City  Birth_year    Name
a  100     Taipei        1990   Sally
b  101     Taipei        1989   Hanks
c  102    Hsinchu        1992  Hannah
d  103     Tainan        1997   Kitty
e  104  Kaohsiung        1982   Steve

In [12]:
attri_data_frame_index1

    ID       City  Birth_year    Name
a  100     Taipei        1990   Sally
b  101     Taipei        1989   Hanks
c  102    Hsinchu        1992  Hannah
d  103     Tainan        1997   Kitty
e  104  Kaohsiung        1982   Steve

# Transpose

In [13]:
#attri_data_frame1的行列交換
attri_data_frame_index1.T

                 a       b        c       d          e
ID             100     101      102     103        104
City        Taipei  Taipei  Hsinchu  Tainan  Kaohsiung
Birth_year    1990    1989     1992    1997       1982
Name         Sally   Hanks   Hannah   Kitty      Steve

# Get One Column

In [14]:
#取得Birth_year行
attri_data_frame_index1.Birth_year

a    1990
b    1989
c    1992
d    1997
e    1982
Name: Birth_year, dtype: int64

# Get Many Column

In [20]:
#取得ID與Birth_year行
attri_data_frame_index1[['ID', 'Birth_year']]

    ID  Birth_year
a  100        1990
b  101        1989
c  102        1992
d  103        1997
e  104        1982

# Filter

In [22]:
# attri_data_frame1中找出City為Taipei的資料
attri_data_frame1[attri_data_frame1['City'] == 'Taipei']

    ID    City  Birth_year   Name
0  100  Taipei        1990  Sally
1  101  Taipei        1989  Hanks

In [21]:
attri_data_frame1['City'] == 'Taipei'

0     True
1     True
2    False
3    False
4    False
Name: City, dtype: bool

# Filter for Many Requiements

In [23]:
#attri_data_frame1中找出City為台北和台南的資料
attri_data_frame1[attri_data_frame1['City'].isin(['Taipei','Tainan'])]

    ID    City  Birth_year   Name
0  100  Taipei        1990  Sally
1  101  Taipei        1989  Hanks
3  103  Tainan        1997  Kitty

# Pratice

In [25]:
#找出attri_data_frame1的Birth_year小於1990
attri_data_frame1[attri_data_frame1['Birth_year'] < 1990]

    ID       City  Birth_year   Name
1  101     Taipei        1989  Hanks
4  104  Kaohsiung        1982  Steve

# Drop Column

In [26]:
#去掉Birth_year這一行
attri_data_frame1.drop(['Birth_year'], axis = 1)

    ID       City    Name
0  100     Taipei   Sally
1  101     Taipei   Hanks
2  102    Hsinchu  Hannah
3  103     Tainan   Kitty
4  104  Kaohsiung   Steve

In [27]:
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}


attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)

attri_data_frame1.drop(['Birth_year'], axis = 1)
print(attri_data_frame1)

#使用assign，使得attri_data_frame1的資料中真正拿掉Birth_year行
attri_data_frame1 = attri_data_frame1.drop(['Birth_year'], axis = 1)
print(attri_data_frame1)

    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID       City    Name
0  100     Taipei   Sally
1  101     Taipei   Hanks
2  102    Hsinchu  Hannah
3  103     Tainan   Kitty
4  104  Kaohsiung   Steve

# Combine DataFrame

In [28]:
#準備資料
attri_data1 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}
attri_data_frame1 = DataFrame(attri_data1)
print(attri_data_frame1)


attri_data2 = {'ID':['100','101','102','105','107'],
               'Math':[50,43,33,76,98],
               'English':[90,30,20,50,30],
               'Sex':['M','F','F','M','M']}
attri_data_frame2 = DataFrame(attri_data2)
print(attri_data_frame2)

    ID       City  Birth_year    Name
0  100     Taipei        1990   Sally
1  101     Taipei        1989   Hanks
2  102    Hsinchu        1992  Hannah
3  103     Tainan        1997   Kitty
4  104  Kaohsiung        1982   Steve
    ID  Math  English Sex
0  100    50       90   M
1  101    43       30   F
2  102    33       20   F
3  105    76       50   M
4  107    98       30   M

In [29]:
#合併資料
pd.merge(attri_data_frame1, attri_data_frame2)

    ID     City  Birth_year    Name  Math  English Sex
0  100   Taipei        1990   Sally    50       90   M
1  101   Taipei        1989   Hanks    43       30   F
2  102  Hsinchu        1992  Hannah    33       20   F

# Statistics

In [30]:
#將「Sex」的行設為基準來計算出數學成績的平均分數
attri_data_frame2.groupby('Sex')['Math'].mean()

Sex
F    38.000000
M    74.666667
Name: Math, dtype: float64

# Practice

In [33]:
#將「Sex」的行設為基準來計算出英文成績的最大值與最小值。
print(attri_data_frame2.groupby('Sex')['English'].max())
attri_data_frame2.groupby('Sex')['English'].min()

Sex
F    30
M    90
Name: English, dtype: int64

Sex
F    20
M    30
Name: English, dtype: int64

# Sort

In [34]:
#準備資料
attri_data2 = {'ID':['100','101','102','103','104'],
               'City':['Taipei','Taipei','Hsinchu','Tainan','Kaohsiung'],
               'Birth_year':[1990,1989,1992,1997,1982],
               'Name':['Sally','Hanks','Hannah','Kitty','Steve']}
attri_data_frame_index2 = DataFrame(attri_data2,index=['e','b','a','d','c'])
attri_data_frame_index2

    ID       City  Birth_year    Name
e  100     Taipei        1990   Sally
b  101     Taipei        1989   Hanks
a  102    Hsinchu        1992  Hannah
d  103     Tainan        1997   Kitty
c  104  Kaohsiung        1982   Steve

In [35]:
#sort by index
attri_data_frame_index2.sort_index()

    ID       City  Birth_year    Name
a  102    Hsinchu        1992  Hannah
b  101     Taipei        1989   Hanks
c  104  Kaohsiung        1982   Steve
d  103     Tainan        1997   Kitty
e  100     Taipei        1990   Sally

In [36]:
#sort by values
attri_data_frame_index2.Birth_year.sort_values()

c    1982
b    1989
e    1990
a    1992
d    1997
Name: Birth_year, dtype: int64

# Check nan

In [37]:
#確認是否存在該值
attri_data_frame_index2.isin(['Taipei'])

      ID   City  Birth_year   Name
e  False   True       False  False
b  False   True       False  False
a  False  False       False  False
d  False  False       False  False
c  False  False       False  False

In [38]:
# 處理遺漏值
# 將Name設成nan
import numpy as np
attri_data_frame_index2['Name'] = np.nan

#判斷是否為nan
attri_data_frame_index2.isnull()

      ID   City  Birth_year  Name
e  False  False       False  True
b  False  False       False  True
a  False  False       False  True
d  False  False       False  True
c  False  False       False  True

In [39]:
#計算nan的總數
attri_data_frame_index2.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

# Practice 1

In [49]:
from pandas import Series,DataFrame
import pandas as pd

attri_data1 = {'ID':['1','2','3','4','5'],
               'Sex':['F','F','M','M','F'],
               'Money':[1000,2000,500,300,700],
               'Name':['Alice','Bob','Candy','David','Ella']}

attri_data_frame1 = DataFrame(attri_data1)
attri_data_frame1

  ID Sex  Money   Name
0  1   F   1000  Alice
1  2   F   2000    Bob
2  3   M    500  Candy
3  4   M    300  David
4  5   F    700   Ella

In [50]:
attri_data_frame1[attri_data_frame1['Money'] >= 500]

  ID Sex  Money   Name
0  1   F   1000  Alice
1  2   F   2000    Bob
2  3   M    500  Candy
4  5   F    700   Ella

In [53]:
attri_data_frame1.groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     400.000000
Name: Money, dtype: float64

In [55]:
attri_data2 = {'ID':['3','4','7'],
               'Math':[60,30,40],
               'English':[80,20,30]}

attri_data_frame2 = DataFrame(attri_data2)
attri_data_frame2

  ID  Math  English
0  3    60       80
1  4    30       20
2  7    40       30

In [59]:
attri_data_frame3 = pd.merge(attri_data_frame1, attri_data_frame2)
attri_data_frame3

  ID Sex  Money   Name  Math  English
0  3   M    500  Candy    60       80
1  4   M    300  David    30       20

In [62]:
attri_data_frame3.mean()

ID          17.0
Money      400.0
Math        45.0
English     50.0
dtype: float64